УчетВУправляющихДляГит1/src/Documents/КВП_СвидетельствоОРегистрацииПоМестуЖительства/КВП_СвидетельствоОРегистрацииПоМестуЖительства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КВП_СвидетельствоОРегистрацииПоМестуЖительства</name>
  <basedOn>Document.КВП_ЗаявлениеОРегистрацииОСнятииСРегистрационногоУчетаПоМестуЖительства</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛицевойСчет</name>
    <type>
      <types>CatalogRef.КВП_ЛицевыеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Проживающий</name>
    <type>
      <types>CatalogRef.УПЖКХ_Жильцы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.КВП_ЗаявлениеОРегистрацииОСнятииСРегистрационногоУчетаПоМестуЖительства</types>
    </type>
  </attributes>
</mdclass:Document>

УчетВУправляющихДляГит1/src/Enums/КВП_ВидыОперацийРегистрацииПоМестуЖительства/КВП_ВидыОперацийРегистрацииПоМестуЖительства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КВП_ВидыОперацийРегистрацииПоМестуЖительства</name>
  <enumValues>
    <name>Регистрация</name>
  </enumValues>
  <enumValues>
    <name>СнятиеСРегистрации</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Documents/КВП_СвидетельствоОРегистрацииПоМестуЖительства/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ДОКУМЕНТА

#Область ОбработчикиСобытийДокумента

// Обработчик события "ОбработкаЗаполнения" документа.
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УПЖКХ_ТиповыеМетодыСервер.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КВП_ЗаявлениеОРегистрацииОСнятииСРегистрационногоУчетаПоМестуЖительства") Тогда
		ДокументОснование = ДанныеЗаполнения;
		Если ДанныеЗаполнения.ВидОперации = Перечисления.КВП_ВидыОперацийРегистрацииПоМестуЖительства.Регистрация Тогда
			
			Организация = ДанныеЗаполнения.Организация;
			ЛицевойСчет = ДанныеЗаполнения.ЛицевойСчет;
			Проживающий = ДанныеЗаполнения.Проживающий;
			Комментарий = ДанныеЗаполнения.Комментарий;
			
		Иначе
			// Если вводится на основании заявления о снятии с регистрации,
			// документ не заполняется.
			
			УПЖКХ_ТиповыеМетодыКлиентСервер.СообщитьОбОшибке("В случае снятия с регистрации свидетельство не заполняется!");
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события "ОбработкаПроверкиЗаполнения" документа.
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Добавить("Организация");
	ПроверяемыеРеквизиты.Добавить("Проживающий");
	ПроверяемыеРеквизиты.Добавить("ЛицевойСчет");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
